cmsis-svd/cmsis-svd/data/Nuvoton/M0519AE_v1.svd
       <register>
          <name>P0_IEN</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>P0_IEN</displayName>
          <description>GPIO Port 0 Interrupt Enable</description>
          <addressOffset>0x1C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IF_EN</name>
              <description>Port 0-a Interrupt Enable by Input Falling Edge or Input Level Low\nIF_EN[n] is used to enable the interrupt for each of the corresponding input Px_PIN[n]. Set bit to 1 also enable the pin wake-up function.\nWhen setting the IF_EN[n] bit to 1:\nIf the interrupt is level trigger, the input PIN[n] state at level "low" will generate the interrupt.\nIf the interrupt is edge trigger, the input PIN[n] state change from "high-to-low" will generate the interrupt.\n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PIN[n] state low-level or high-to-low change interrupt Disabled</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PIN[n] state low-level or high-to-low change interrupt Enabled</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>IR_EN</name>
              <description>Port 0-a Interrupt Enable by Input Rising Edge or Input Level High\nIR_EN[n] used to enable the interrupt for each of the corresponding input Px_PIN[n]. Set bit to 1 also enable the pin wake-up function.\nWhen setting the IR_EN[n] bit to 1:\nIf the interrupt is level trigger, the input PIN[n] state at level "high" will generate the interrupt.\nIf the interrupt is edge trigger, the input PIN[n] state change from "low-to-high" will generate the interrupt.\n</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PIN[n] level-high or low-to-high interrupt Disabled</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PIN[n] level-high or low-to-high interrupt Enabled</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>P0_ISF</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>P0_ISF</displayName>
          <description>GPIO Port 0 Interrupt Source Flag</description>
          <addressOffset>0x20</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>IF_ISF</name>
              <description>Port 0-a Interrupt Source Flag\nThese bits are edge/level trigger event indicators of each pin of Port x, if GPG0_INT or GPG1_INT enable bit is set, the corresponding interrupt service routine will be served. Note that P3.2 and P3.3 will only vector to INT0_INT and INT1_INT ISRs if its own interrupt is enabled.\nRead :\n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No interrupt at Px[n].\nNo action</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Px[n] generates an interrupt.\nClear the corresponding pending interrupt</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="P0_PMD">
          <name>P1_PMD</name>
          <displayName>P1_PMD</displayName>
          <description>GPIO Port 1 Pin I/O Mode Control</description>
          <addressOffset>0x40</addressOffset>
       </register>
       <register derivedFrom="P0_OFFD">
          <name>P1_OFFD</name>
          <displayName>P1_OFFD</displayName>
          <description>GPIO Port 1 Pin Digital Input Path Disable Control</description>
          <addressOffset>0x44</addressOffset>
       </register>
       <register derivedFrom="P0_DOUT">
          <name>P1_DOUT</name>
          <displayName>P1_DOUT</displayName>
          <description>GPIO Port 1 Data Output Value</description>
          <addressOffset>0x48</addressOffset>
       </register>
       <register derivedFrom="P0_DMASK">
          <name>P1_DMASK</name>
          <displayName>P1_DMASK</displayName>
          <description>GPIO Port 1 Data Output Write Mask</description>
          <addressOffset>0x4C</addressOffset>
       </register>
       <register derivedFrom="P0_PIN">
          <name>P1_PIN</name>
          <displayName>P1_PIN</displayName>
          <description>GPIO Port 1 Pin Value</description>
          <addressOffset>0x50</addressOffset>
       </register>
       <register derivedFrom="P0_DBEN">
          <name>P1_DBEN</name>
          <displayName>P1_DBEN</displayName>
          <description>GPIO Port 1 De-bounce Enable</description>
          <addressOffset>0x54</addressOffset>
       </register>
       <register derivedFrom="P0_IMD">
          <name>P1_IMD</name>
          <displayName>P1_IMD</displayName>
          <description>GPIO Port 1 Interrupt Mode Control</description>
          <addressOffset>0x58</addressOffset>
       </register>
