cmsis-svd/cmsis-svd/data/Nuvoton/M0519AE_v1.svd
       <register derivedFrom="P0_IEN">
          <name>P4_IEN</name>
          <displayName>P4_IEN</displayName>
          <description>GPIO Port 4 Interrupt Enable</description>
          <addressOffset>0x11C</addressOffset>
       </register>
       <register derivedFrom="P0_ISF">
          <name>P4_ISF</name>
          <displayName>P4_ISF</displayName>
          <description>GPIO Port 4 Interrupt Source Flag</description>
          <addressOffset>0x120</addressOffset>
       </register>
       <register derivedFrom="P0_PMD">
          <name>P5_PMD</name>
          <displayName>P5_PMD</displayName>
          <description>GPIO Port 5 Pin I/O Mode Control</description>
          <addressOffset>0x140</addressOffset>
       </register>
       <register derivedFrom="P0_OFFD">
          <name>P5_OFFD</name>
          <displayName>P5_OFFD</displayName>
          <description>GPIO Port 5 Pin Digital Input Path Disable Control</description>
          <addressOffset>0x144</addressOffset>
       </register>
       <register derivedFrom="P0_DOUT">
          <name>P5_DOUT</name>
          <displayName>P5_DOUT</displayName>
          <description>GPIO Port 5 Data Output Value</description>
          <addressOffset>0x148</addressOffset>
       </register>
       <register derivedFrom="P0_DMASK">
          <name>P5_DMASK</name>
          <displayName>P5_DMASK</displayName>
          <description>GPIO Port 5 Data Output Write Mask</description>
          <addressOffset>0x14C</addressOffset>
       </register>
       <register derivedFrom="P0_PIN">
          <name>P5_PIN</name>
          <displayName>P5_PIN</displayName>
          <description>GPIO Port 5 Pin Value</description>
          <addressOffset>0x150</addressOffset>
       </register>
       <register derivedFrom="P0_DBEN">
          <name>P5_DBEN</name>
          <displayName>P5_DBEN</displayName>
          <description>GPIO Port 5 De-bounce Enable</description>
          <addressOffset>0x154</addressOffset>
       </register>
       <register derivedFrom="P0_IMD">
          <name>P5_IMD</name>
          <displayName>P5_IMD</displayName>
          <description>GPIO Port 5 Interrupt Mode Control</description>
          <addressOffset>0x158</addressOffset>
       </register>
       <register derivedFrom="P0_IEN">
          <name>P5_IEN</name>
          <displayName>P5_IEN</displayName>
          <description>GPIO Port 5 Interrupt Enable</description>
          <addressOffset>0x15C</addressOffset>
       </register>
       <register derivedFrom="P0_ISF">
          <name>P5_ISF</name>
          <displayName>P5_ISF</displayName>
          <description>GPIO Port 5 Interrupt Source Flag</description>
          <addressOffset>0x160</addressOffset>
       </register>
       <register derivedFrom="P0_PMD">
          <name>P6_PMD</name>
          <displayName>P6_PMD</displayName>
          <description>GPIO Port 6 Pin I/O Mode Control</description>
          <addressOffset>0x180</addressOffset>
       </register>
       <register derivedFrom="P0_OFFD">
          <name>P6_OFFD</name>
          <displayName>P6_OFFD</displayName>
          <description>GPIO Port 6 Pin Digital Input Path Disable Control</description>
          <addressOffset>0x184</addressOffset>
       </register>
       <register derivedFrom="P0_DOUT">
          <name>P6_DOUT</name>
          <displayName>P6_DOUT</displayName>
          <description>GPIO Port 6 Data Output Value</description>
          <addressOffset>0x188</addressOffset>
       </register>
       <register derivedFrom="P0_DMASK">
          <name>P6_DMASK</name>
          <displayName>P6_DMASK</displayName>
          <description>GPIO Port 6 Data Output Write Mask</description>
          <addressOffset>0x18C</addressOffset>
       </register>
       <register derivedFrom="P0_PIN">
          <name>P6_PIN</name>
          <displayName>P6_PIN</displayName>
          <description>GPIO Port 6 Pin Value</description>
          <addressOffset>0x190</addressOffset>
       </register>
       <register derivedFrom="P0_DBEN">
          <name>P6_DBEN</name>
          <displayName>P6_DBEN</displayName>
          <description>GPIO Port 6 De-bounce Enable</description>
          <addressOffset>0x194</addressOffset>
       </register>
       <register derivedFrom="P0_IMD">
          <name>P6_IMD</name>
          <displayName>P6_IMD</displayName>
          <description>GPIO Port 6 Interrupt Mode Control</description>
          <addressOffset>0x198</addressOffset>
       </register>
       <register derivedFrom="P0_IEN">
          <name>P6_IEN</name>
          <displayName>P6_IEN</displayName>
          <description>GPIO Port 6 Interrupt Enable</description>
          <addressOffset>0x19C</addressOffset>
       </register>
       <register derivedFrom="P0_PMD">
          <name>P7_PMD</name>
          <displayName>P7_PMD</displayName>
          <description>GPIO Port 7 Pin I/O Mode Control</description>
          <addressOffset>0x1C0</addressOffset>
       </register>
       <register derivedFrom="P0_OFFD">
          <name>P7_OFFD</name>
          <displayName>P7_OFFD</displayName>
          <description>GPIO Port 7 Pin Digital Input Path Disable Control</description>
          <addressOffset>0x1C4</addressOffset>
       </register>
       <register derivedFrom="P0_DOUT">
          <name>P7_DOUT</name>
          <displayName>P7_DOUT</displayName>
          <description>GPIO Port 7 Data Output Value</description>
          <addressOffset>0x1C8</addressOffset>
       </register>
       <register derivedFrom="P0_DMASK">
          <name>P7_DMASK</name>
          <displayName>P7_DMASK</displayName>
          <description>GPIO Port 7 Data Output Write Mask</description>
          <addressOffset>0x1CC</addressOffset>
       </register>
       <register derivedFrom="P0_PIN">
          <name>P7_PIN</name>
          <displayName>P7_PIN</displayName>
          <description>GPIO Port 7 Pin Value</description>
          <addressOffset>0x1D0</addressOffset>
       </register>
       <register derivedFrom="P0_DBEN">
          <name>P7_DBEN</name>
          <displayName>P7_DBEN</displayName>
          <description>GPIO Port 7 De-bounce Enable</description>
          <addressOffset>0x1D4</addressOffset>
       </register>
       <register derivedFrom="P0_IMD">
          <name>P7_IMD</name>
          <displayName>P7_IMD</displayName>
          <description>GPIO Port 7 Interrupt Mode Control</description>
          <addressOffset>0x1D8</addressOffset>
       </register>
