cmsis-svd/cmsis-svd/data/Nuvoton/M0519AE_v1.svd
       <register derivedFrom="P0_IEN">
          <name>P7_IEN</name>
          <displayName>P7_IEN</displayName>
          <description>GPIO Port 7 Interrupt Enable</description>
          <addressOffset>0x1DC</addressOffset>
       </register>
       <register derivedFrom="P0_ISF">
          <name>P7_ISF</name>
          <displayName>P7_ISF</displayName>
          <description>GPIO Port 7 Interrupt Source Flag</description>
          <addressOffset>0x1E0</addressOffset>
       </register>
       <register derivedFrom="P0_ISF">
          <name>P6_ISF</name>
          <displayName>P6_ISF</displayName>
          <description>GPIO Port 6 Interrupt Source Flag</description>
          <addressOffset>0x200</addressOffset>
       </register>
       <register derivedFrom="P0_PMD">
          <name>P8_PMD</name>
          <displayName>P8_PMD</displayName>
          <description>GPIO Port 8 Pin I/O Mode Control</description>
          <alternateRegister>P6_ISF</alternateRegister>
          <addressOffset>0x200</addressOffset>
       </register>
       <register derivedFrom="P0_OFFD">
          <name>P8_OFFD</name>
          <displayName>P8_OFFD</displayName>
          <description>GPIO Port 8 Pin Digital Input Path Disable Control</description>
          <addressOffset>0x204</addressOffset>
       </register>
       <register derivedFrom="P0_DOUT">
          <name>P8_DOUT</name>
          <displayName>P8_DOUT</displayName>
          <description>GPIO Port 8 Data Output Value</description>
          <addressOffset>0x208</addressOffset>
       </register>
       <register derivedFrom="P0_DMASK">
          <name>P8_DMASK</name>
          <displayName>P8_DMASK</displayName>
          <description>GPIO Port 8 Data Output Write Mask</description>
          <addressOffset>0x20C</addressOffset>
       </register>
       <register derivedFrom="P0_PIN">
          <name>P8_PIN</name>
          <displayName>P8_PIN</displayName>
          <description>GPIO Port 8 Pin Value</description>
          <addressOffset>0x210</addressOffset>
       </register>
       <register derivedFrom="P0_DBEN">
          <name>P8_DBEN</name>
          <displayName>P8_DBEN</displayName>
          <description>GPIO Port 8 De-bounce Enable</description>
          <addressOffset>0x214</addressOffset>
       </register>
       <register derivedFrom="P0_IMD">
          <name>P8_IMD</name>
          <displayName>P8_IMD</displayName>
          <description>GPIO Port 8 Interrupt Mode Control</description>
          <addressOffset>0x218</addressOffset>
       </register>
       <register derivedFrom="P0_IEN">
          <name>P8_IEN</name>
          <displayName>P8_IEN</displayName>
          <description>GPIO Port 8 Interrupt Enable</description>
          <addressOffset>0x21C</addressOffset>
       </register>
       <register derivedFrom="P0_ISF">
          <name>P8_ISF</name>
          <displayName>P8_ISF</displayName>
          <description>GPIO Port 8 Interrupt Source Flag</description>
          <addressOffset>0x220</addressOffset>
       </register>
       <register derivedFrom="P0_PMD">
          <name>P9_PMD</name>
          <displayName>P9_PMD</displayName>
          <description>GPIO Port 9 Pin I/O Mode Control</description>
          <addressOffset>0x240</addressOffset>
       </register>
       <register derivedFrom="P0_OFFD">
          <name>P9_OFFD</name>
          <displayName>P9_OFFD</displayName>
          <description>GPIO Port 9 Pin Digital Input Path Disable Control</description>
          <addressOffset>0x244</addressOffset>
       </register>
       <register derivedFrom="P0_DOUT">
          <name>P9_DOUT</name>
          <displayName>P9_DOUT</displayName>
          <description>GPIO Port 9 Data Output Value</description>
          <addressOffset>0x248</addressOffset>
       </register>
       <register derivedFrom="P0_DMASK">
          <name>P9_DMASK</name>
          <displayName>P9_DMASK</displayName>
          <description>GPIO Port 9 Data Output Write Mask</description>
          <addressOffset>0x24C</addressOffset>
       </register>
       <register derivedFrom="P0_PIN">
          <name>P9_PIN</name>
          <displayName>P9_PIN</displayName>
          <description>GPIO Port 9 Pin Value</description>
          <addressOffset>0x250</addressOffset>
       </register>
       <register derivedFrom="P0_DBEN">
          <name>P9_DBEN</name>
          <displayName>P9_DBEN</displayName>
          <description>GPIO Port 9 De-bounce Enable</description>
          <addressOffset>0x254</addressOffset>
       </register>
       <register derivedFrom="P0_IMD">
          <name>P9_IMD</name>
          <displayName>P9_IMD</displayName>
          <description>GPIO Port 9 Interrupt Mode Control</description>
          <addressOffset>0x258</addressOffset>
       </register>
       <register derivedFrom="P0_IEN">
          <name>P9_IEN</name>
          <displayName>P9_IEN</displayName>
          <description>GPIO Port 9 Interrupt Enable</description>
          <addressOffset>0x25C</addressOffset>
       </register>
       <register derivedFrom="P0_ISF">
          <name>P9_ISF</name>
          <displayName>P9_ISF</displayName>
          <description>GPIO Port 9 Interrupt Source Flag</description>
          <addressOffset>0x260</addressOffset>
       </register>
       <register derivedFrom="P0_PMD">
          <name>PA_PMD</name>
          <displayName>PA_PMD</displayName>
          <description>GPIO Port A Pin I/O Mode Control</description>
          <addressOffset>0x280</addressOffset>
       </register>
       <register derivedFrom="P0_OFFD">
          <name>PA_OFFD</name>
          <displayName>PA_OFFD</displayName>
          <description>GPIO Port A Pin Digital Input Path Disable Control</description>
          <addressOffset>0x284</addressOffset>
       </register>
       <register derivedFrom="P0_DOUT">
          <name>PA_DOUT</name>
          <displayName>PA_DOUT</displayName>
          <description>GPIO Port A Data Output Value</description>
          <addressOffset>0x288</addressOffset>
       </register>
       <register derivedFrom="P0_DMASK">
          <name>PA_DMASK</name>
          <displayName>PA_DMASK</displayName>
          <description>GPIO Port A Data Output Write Mask</description>
          <addressOffset>0x28C</addressOffset>
       </register>
       <register derivedFrom="P0_PIN">
          <name>PA_PIN</name>
          <displayName>PA_PIN</displayName>
          <description>GPIO Port A Pin Value</description>
          <addressOffset>0x290</addressOffset>
       </register>
       <register derivedFrom="P0_DBEN">
          <name>PA_DBEN</name>
          <displayName>PA_DBEN</displayName>
          <description>GPIO Port A De-bounce Enable</description>
          <addressOffset>0x294</addressOffset>
       </register>
       <register derivedFrom="P0_IMD">
          <name>PA_IMD</name>
          <displayName>PA_IMD</displayName>
          <description>GPIO Port A Interrupt Mode Control</description>
          <addressOffset>0x298</addressOffset>
       </register>
