cmsis-svd/cmsis-svd/data/Nuvoton/M0519AE_v1.svd
       <register derivedFrom="P0_IEN">
          <name>PA_IEN</name>
          <displayName>PA_IEN</displayName>
          <description>GPIO Port A Interrupt Enable</description>
          <addressOffset>0x29C</addressOffset>
       </register>
       <register derivedFrom="P0_ISF">
          <name>PA_ISF</name>
          <displayName>PA_ISF</displayName>
          <description>GPIO Port A Interrupt Source Flag</description>
          <addressOffset>0x2A0</addressOffset>
       </register>
       <register>
          <name>DBNCECON</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>DBNCECON</displayName>
          <description>External Interrupt De-bounce Control</description>
          <addressOffset>0x2E0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DBCLKSEL</name>
              <description>De-bounce Sampling Cycle Selection\n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Sample interrupt input once per 1 clocks</description>
                    <value>#0000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Sample interrupt input once per 2 clocks</description>
                    <value>#0001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Sample interrupt input once per 4 clocks</description>
                    <value>#0010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Sample interrupt input once per 8 clocks</description>
                    <value>#0011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>Sample interrupt input once per 16 clocks</description>
                    <value>#0100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>5</name>
                    <description>Sample interrupt input once per 32 clocks</description>
                    <value>#0101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>Sample interrupt input once per 64 clocks</description>
                    <value>#0110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>Sample interrupt input once per 128 clocks</description>
                    <value>#0111</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>8</name>
                    <description>Sample interrupt input once per 256 clocks</description>
                    <value>#1000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>9</name>
                    <description>Sample interrupt input once per 2*256 clocks</description>
                    <value>#1001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>10</name>
                    <description>Sample interrupt input once per 4*256 clocks</description>
                    <value>#1010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>11</name>
                    <description>Sample interrupt input once per 8*256 clocks</description>
                    <value>#1011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>12</name>
                    <description>Sample interrupt input once per 16*256 clocks</description>
                    <value>#1100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>13</name>
                    <description>Sample interrupt input once per 32*256 clocks</description>
                    <value>#1101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>14</name>
                    <description>Sample interrupt input once per 64*256 clocks</description>
                    <value>#1110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>15</name>
                    <description>Sample interrupt input once per 128*256 clocks</description>
                    <value>#1111</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DBCLKSRC</name>
              <description>De-bounce Counter Clock Source Selection\n</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>De-bounce counter clock source is the HCLK</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>De-bounce counter clock source is the internal 10 kHz low speed oscillator</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ICLK_ON</name>
              <description>Interrupt Clock on Mode\nIt is recommended to turn off this bit to save system power if no special application concern.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Edge detection circuit is active only if I/O pin corresponding Px_IEN bit is set to 1</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>All I/O pins edge detection circuit is always active after reset</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>PWMPOEN</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PWMPOEN</displayName>
          <description>PWM Port Output Enable</description>
          <addressOffset>0x2E4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFF00</resetMask>
          <fields>
            <field>
              <name>HZ_Even0</name>
              <description>Enhanced PWM Unit0 Even Ports Output Control\nNote: The initial value is loaded from CHZ_Even0 (Config0[8]) after any reset.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The driving mode of Enhanced PWM unit0 even ports are controlled by GPIO mode register (Px_PMD) or multi-function register (Px_MFP)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The driving mode of Enhanced PWM unit0 even ports are forced in tri-state (Hi-Z) all the time</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>HZ_Odd0</name>
              <description>Enhanced PWM Unit0 Odd Ports Output Control\nNote: The initial value is loaded from CHZ_Odd0 (Config0[9]) after any reset.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The driving mode of Enhanced PWM unit0 odd ports are controlled by GPIO mode register (Px_PMD) or multi-function register (Px_MFP)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The driving mode of Enhanced PWM unit0 odd ports are forced in tri-state (Hi-Z) all the time</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>HZ_Even1</name>
              <description>Enhanced PWM Unit1 Even Ports Output Control\nNote: The initial value is loaded from CHZ_Even1 (Config0[10]) after any reset.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The driving mode of Enhanced PWM unit1 even ports are controlled by GPIO mode register (Px_PMD) or multi-function register (Px_MFP)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The driving mode of Enhanced PWM unit1 even ports are forced in tri-state (Hi-Z) all the time</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>HZ_Odd1</name>
              <description>Enhanced PWM Unit1 Odd Ports Output Control\nNote: The initial value is loaded from CHZ_Odd1 (Config0[11]) after any reset.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The driving mode of Enhanced PWM unit1 odd ports are controlled by GPIO mode register (Px_PMD) or multi-function register (Px_MFP)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The driving mode of Enhanced PWM unit1 odd ports are forced in tri-state (Hi-Z) all the time</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>HZ_BPWM</name>
              <description>Basic PWM0 Ports Output Control\nNote: The initial value is loaded from CHZ_BPWM (Config0[12]) after any reset.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The driving mode of Basic PWM ports are controlled by GPIO mode register</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The driving mode of Basic PWM ports are forced in tri-state (Hi-Z) all the time</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>P0_0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>P0_0</displayName>
          <description>GPIO P0.n Pin Data Input/Output</description>
          <addressOffset>0x300</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFF0</resetMask>
          <fields>
            <field>
              <name>Pxn</name>
              <description>GPIO Px.N Pin Data Input/Output\nWrite this bit can control one GPIO pin output value.\nRead this register to get GPIO pin status.\nFor example: writing P0_0 will reflect the written value to bit P0_DOUT[0], read P0_0 will return the value of P0_PIN[0].\nNote: The write operation will not be affected by register Px_DMASK.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Corresponding GPIO pin set to low</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Corresponding GPIO pin set to high</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="P0_0">
          <name>P0_1</name>
          <displayName>P0_1</displayName>
          <description>GPIO P0.n Pin Data Input/Output</description>
          <addressOffset>0x304</addressOffset>
       </register>
       <register derivedFrom="P0_0">
          <name>P0_2</name>
          <displayName>P0_2</displayName>
          <description>GPIO P0.n Pin Data Input/Output</description>
          <addressOffset>0x308</addressOffset>
       </register>
       <register derivedFrom="P0_0">
          <name>P0_3</name>
          <displayName>P0_3</displayName>
          <description>GPIO P0.n Pin Data Input/Output</description>
          <addressOffset>0x30C</addressOffset>
       </register>
       <register derivedFrom="P0_0">
          <name>P0_4</name>
          <displayName>P0_4</displayName>
          <description>GPIO P0.n Pin Data Input/Output</description>
          <addressOffset>0x310</addressOffset>
       </register>
       <register derivedFrom="P0_0">
          <name>P0_5</name>
          <displayName>P0_5</displayName>
          <description>GPIO P0.n Pin Data Input/Output</description>
          <addressOffset>0x314</addressOffset>
       </register>
       <register derivedFrom="P0_0">
          <name>P0_6</name>
          <displayName>P0_6</displayName>
          <description>GPIO P0.n Pin Data Input/Output</description>
          <addressOffset>0x318</addressOffset>
       </register>
       <register derivedFrom="P0_0">
          <name>P0_7</name>
          <displayName>P0_7</displayName>
          <description>GPIO P0.n Pin Data Input/Output</description>
          <addressOffset>0x31C</addressOffset>
       </register>
       <register derivedFrom="P0_0">
          <name>P1_0</name>
          <displayName>P1_0</displayName>
          <description>GPIO P1.n Pin Data Input/Output</description>
          <addressOffset>0x320</addressOffset>
       </register>
       <register derivedFrom="P1_0">
          <name>P1_1</name>
          <displayName>P1_1</displayName>
          <description>GPIO P1.n Pin Data Input/Output</description>
          <addressOffset>0x324</addressOffset>
       </register>
       <register derivedFrom="P1_0">
          <name>P1_2</name>
          <displayName>P1_2</displayName>
          <description>GPIO P1.n Pin Data Input/Output</description>
          <addressOffset>0x328</addressOffset>
       </register>
       <register derivedFrom="P1_0">
          <name>P1_3</name>
          <displayName>P1_3</displayName>
          <description>GPIO P1.n Pin Data Input/Output</description>
          <addressOffset>0x32C</addressOffset>
       </register>
       <register derivedFrom="P1_0">
          <name>P1_4</name>
          <displayName>P1_4</displayName>
          <description>GPIO P1.n Pin Data Input/Output</description>
          <addressOffset>0x330</addressOffset>
       </register>
       <register derivedFrom="P1_0">
          <name>P1_5</name>
          <displayName>P1_5</displayName>
          <description>GPIO P1.n Pin Data Input/Output</description>
          <addressOffset>0x334</addressOffset>
       </register>
       <register derivedFrom="P1_0">
          <name>P1_6</name>
          <displayName>P1_6</displayName>
          <description>GPIO P1.n Pin Data Input/Output</description>
          <addressOffset>0x338</addressOffset>
       </register>
       <register derivedFrom="P1_0">
          <name>P1_7</name>
          <displayName>P1_7</displayName>
          <description>GPIO P1.n Pin Data Input/Output</description>
          <addressOffset>0x33C</addressOffset>
       </register>
       <register derivedFrom="P0_0">
          <name>P2_0</name>
          <displayName>P2_0</displayName>
          <description>GPIO P2.n Pin Data Input/Output</description>
          <addressOffset>0x340</addressOffset>
       </register>
       <register derivedFrom="P2_0">
          <name>P2_1</name>
          <displayName>P2_1</displayName>
          <description>GPIO P2.n Pin Data Input/Output</description>
          <addressOffset>0x344</addressOffset>
       </register>
       <register derivedFrom="P2_0">
          <name>P2_2</name>
          <displayName>P2_2</displayName>
          <description>GPIO P2.n Pin Data Input/Output</description>
          <addressOffset>0x348</addressOffset>
       </register>
       <register derivedFrom="P2_0">
          <name>P2_3</name>
          <displayName>P2_3</displayName>
          <description>GPIO P2.n Pin Data Input/Output</description>
          <addressOffset>0x34C</addressOffset>
       </register>
       <register derivedFrom="P2_0">
          <name>P2_4</name>
          <displayName>P2_4</displayName>
          <description>GPIO P2.n Pin Data Input/Output</description>
          <addressOffset>0x350</addressOffset>
       </register>
       <register derivedFrom="P2_0">
          <name>P2_5</name>
          <displayName>P2_5</displayName>
          <description>GPIO P2.n Pin Data Input/Output</description>
          <addressOffset>0x354</addressOffset>
       </register>
       <register derivedFrom="P2_0">
          <name>P2_6</name>
          <displayName>P2_6</displayName>
          <description>GPIO P2.n Pin Data Input/Output</description>
          <addressOffset>0x358</addressOffset>
       </register>
       <register derivedFrom="P2_0">
          <name>P2_7</name>
          <displayName>P2_7</displayName>
          <description>GPIO P2.n Pin Data Input/Output</description>
          <addressOffset>0x35C</addressOffset>
       </register>
       <register derivedFrom="P0_0">
          <name>P3_0</name>
          <displayName>P3_0</displayName>
          <description>GPIO P3.n Pin Data Input/Output</description>
          <addressOffset>0x360</addressOffset>
       </register>
       <register derivedFrom="P3_0">
          <name>P3_1</name>
          <displayName>P3_1</displayName>
          <description>GPIO P3.n Pin Data Input/Output</description>
          <addressOffset>0x364</addressOffset>
       </register>
       <register derivedFrom="P3_0">
          <name>P3_2</name>
          <displayName>P3_2</displayName>
          <description>GPIO P3.n Pin Data Input/Output</description>
          <addressOffset>0x368</addressOffset>
       </register>
       <register derivedFrom="P3_0">
          <name>P3_3</name>
          <displayName>P3_3</displayName>
          <description>GPIO P3.n Pin Data Input/Output</description>
          <addressOffset>0x36C</addressOffset>
       </register>
       <register derivedFrom="P3_0">
          <name>P3_4</name>
          <displayName>P3_4</displayName>
          <description>GPIO P3.n Pin Data Input/Output</description>
          <addressOffset>0x370</addressOffset>
       </register>
       <register derivedFrom="P3_0">
          <name>P3_5</name>
          <displayName>P3_5</displayName>
          <description>GPIO P3.n Pin Data Input/Output</description>
          <addressOffset>0x374</addressOffset>
       </register>
       <register derivedFrom="P3_0">
          <name>P3_6</name>
          <displayName>P3_6</displayName>
          <description>GPIO P3.n Pin Data Input/Output</description>
          <addressOffset>0x378</addressOffset>
       </register>
       <register derivedFrom="P3_0">
          <name>P3_7</name>
          <displayName>P3_7</displayName>
          <description>GPIO P3.n Pin Data Input/Output</description>
          <addressOffset>0x37C</addressOffset>
       </register>
       <register derivedFrom="P0_0">
          <name>P4_0</name>
          <displayName>P4_0</displayName>
          <description>GPIO P4.n Pin Data Input/Output</description>
          <addressOffset>0x380</addressOffset>
       </register>
       <register derivedFrom="P4_0">
          <name>P4_1</name>
          <displayName>P4_1</displayName>
          <description>GPIO P4.n Pin Data Input/Output</description>
          <addressOffset>0x384</addressOffset>
       </register>
       <register derivedFrom="P4_0">
          <name>P4_2</name>
          <displayName>P4_2</displayName>
          <description>GPIO P4.n Pin Data Input/Output</description>
          <addressOffset>0x388</addressOffset>
       </register>
       <register derivedFrom="P4_0">
          <name>P4_3</name>
          <displayName>P4_3</displayName>
          <description>GPIO P4.n Pin Data Input/Output</description>
          <addressOffset>0x38C</addressOffset>
       </register>
       <register derivedFrom="P4_0">
          <name>P4_4</name>
          <displayName>P4_4</displayName>
          <description>GPIO P4.n Pin Data Input/Output</description>
          <addressOffset>0x390</addressOffset>
       </register>
       <register derivedFrom="P4_0">
          <name>P4_5</name>
          <displayName>P4_5</displayName>
          <description>GPIO P4.n Pin Data Input/Output</description>
          <addressOffset>0x394</addressOffset>
       </register>
       <register derivedFrom="P4_0">
          <name>P4_6</name>
          <displayName>P4_6</displayName>
          <description>GPIO P4.n Pin Data Input/Output</description>
          <addressOffset>0x398</addressOffset>
       </register>
       <register derivedFrom="P4_0">
          <name>P4_7</name>
          <displayName>P4_7</displayName>
          <description>GPIO P4.n Pin Data Input/Output</description>
          <addressOffset>0x39C</addressOffset>
       </register>
       <register derivedFrom="P0_0">
          <name>P5_0</name>
          <displayName>P5_0</displayName>
          <description>GPIO P5.n Pin Data Input/Output</description>
          <addressOffset>0x3A0</addressOffset>
       </register>
       <register derivedFrom="P5_0">
          <name>P5_1</name>
          <displayName>P5_1</displayName>
          <description>GPIO P5.n Pin Data Input/Output</description>
          <addressOffset>0x3A4</addressOffset>
       </register>
