cmsis-svd/cmsis-svd/data/Nuvoton/M0519AE_v1.svd
       <register derivedFrom="P5_0">
          <name>P5_2</name>
          <displayName>P5_2</displayName>
          <description>GPIO P5.n Pin Data Input/Output</description>
          <addressOffset>0x3A8</addressOffset>
       </register>
       <register derivedFrom="P5_0">
          <name>P5_3</name>
          <displayName>P5_3</displayName>
          <description>GPIO P5.n Pin Data Input/Output</description>
          <addressOffset>0x3AC</addressOffset>
       </register>
       <register derivedFrom="P5_0">
          <name>P5_4</name>
          <displayName>P5_4</displayName>
          <description>GPIO P5.n Pin Data Input/Output</description>
          <addressOffset>0x3B0</addressOffset>
       </register>
       <register derivedFrom="P5_0">
          <name>P5_5</name>
          <displayName>P5_5</displayName>
          <description>GPIO P5.n Pin Data Input/Output</description>
          <addressOffset>0x3B4</addressOffset>
       </register>
       <register derivedFrom="P5_0">
          <name>P5_6</name>
          <displayName>P5_6</displayName>
          <description>GPIO P5.n Pin Data Input/Output</description>
          <addressOffset>0x3B8</addressOffset>
       </register>
       <register derivedFrom="P5_0">
          <name>P5_7</name>
          <displayName>P5_7</displayName>
          <description>GPIO P5.n Pin Data Input/Output</description>
          <addressOffset>0x3BC</addressOffset>
       </register>
       <register derivedFrom="P0_0">
          <name>P6_0</name>
          <displayName>P6_0</displayName>
          <description>GPIO P6.n Pin Data Input/Output</description>
          <addressOffset>0x3C0</addressOffset>
       </register>
       <register derivedFrom="P6_0">
          <name>P6_1</name>
          <displayName>P6_1</displayName>
          <description>GPIO P6.n Pin Data Input/Output</description>
          <addressOffset>0x3C4</addressOffset>
       </register>
       <register derivedFrom="P6_0">
          <name>P6_2</name>
          <displayName>P6_2</displayName>
          <description>GPIO P6.n Pin Data Input/Output</description>
          <addressOffset>0x3C8</addressOffset>
       </register>
       <register derivedFrom="P6_0">
          <name>P6_3</name>
          <displayName>P6_3</displayName>
          <description>GPIO P6.n Pin Data Input/Output</description>
          <addressOffset>0x3CC</addressOffset>
       </register>
       <register derivedFrom="P6_0">
          <name>P6_4</name>
          <displayName>P6_4</displayName>
          <description>GPIO P6.n Pin Data Input/Output</description>
          <addressOffset>0x3D0</addressOffset>
       </register>
       <register derivedFrom="P6_0">
          <name>P6_5</name>
          <displayName>P6_5</displayName>
          <description>GPIO P6.n Pin Data Input/Output</description>
          <addressOffset>0x3D4</addressOffset>
       </register>
       <register derivedFrom="P6_0">
          <name>P6_6</name>
          <displayName>P6_6</displayName>
          <description>GPIO P6.n Pin Data Input/Output</description>
          <addressOffset>0x3D8</addressOffset>
       </register>
       <register derivedFrom="P6_0">
          <name>P6_7</name>
          <displayName>P6_7</displayName>
          <description>GPIO P6.n Pin Data Input/Output</description>
          <addressOffset>0x3DC</addressOffset>
       </register>
       <register derivedFrom="P0_0">
          <name>P7_0</name>
          <displayName>P7_0</displayName>
          <description>GPIO P7.n Pin Data Input/Output</description>
          <addressOffset>0x3E0</addressOffset>
       </register>
       <register derivedFrom="P7_0">
          <name>P7_1</name>
          <displayName>P7_1</displayName>
          <description>GPIO P7.n Pin Data Input/Output</description>
          <addressOffset>0x3E4</addressOffset>
       </register>
       <register derivedFrom="P7_0">
          <name>P7_2</name>
          <displayName>P7_2</displayName>
          <description>GPIO P7.n Pin Data Input/Output</description>
          <addressOffset>0x3E8</addressOffset>
       </register>
       <register derivedFrom="P7_0">
          <name>P7_3</name>
          <displayName>P7_3</displayName>
          <description>GPIO P7.n Pin Data Input/Output</description>
          <addressOffset>0x3EC</addressOffset>
       </register>
       <register derivedFrom="P7_0">
          <name>P7_4</name>
          <displayName>P7_4</displayName>
          <description>GPIO P7.n Pin Data Input/Output</description>
          <addressOffset>0x3F0</addressOffset>
       </register>
       <register derivedFrom="P7_0">
          <name>P7_5</name>
          <displayName>P7_5</displayName>
          <description>GPIO P7.n Pin Data Input/Output</description>
          <addressOffset>0x3F4</addressOffset>
       </register>
       <register derivedFrom="P7_0">
          <name>P7_6</name>
          <displayName>P7_6</displayName>
          <description>GPIO P7.n Pin Data Input/Output</description>
          <addressOffset>0x3F8</addressOffset>
       </register>
       <register derivedFrom="P7_0">
          <name>P7_7</name>
          <displayName>P7_7</displayName>
          <description>GPIO P7.n Pin Data Input/Output</description>
          <addressOffset>0x3FC</addressOffset>
       </register>
       <register derivedFrom="P0_0">
          <name>P8_0</name>
          <displayName>P8_0</displayName>
          <description>GPIO P8.n Pin Data Input/Output</description>
          <addressOffset>0x400</addressOffset>
       </register>
       <register derivedFrom="P8_0">
          <name>P8_1</name>
          <displayName>P8_1</displayName>
          <description>GPIO P8.n Pin Data Input/Output</description>
          <addressOffset>0x404</addressOffset>
       </register>
       <register derivedFrom="P8_0">
          <name>P8_2</name>
          <displayName>P8_2</displayName>
          <description>GPIO P8.n Pin Data Input/Output</description>
          <addressOffset>0x408</addressOffset>
       </register>
