cmsis-svd/cmsis-svd/data/Nuvoton/M0519AE_v1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>HDIV</name>
      <description>HDIV Register Map</description>
      <groupName>HDIV</groupName>
      <baseAddress>0x50014000</baseAddress>
      <!-- the first addressBlock is occupied by registers. The second block is reserved -> no access permission -->
      <addressBlock>
        <offset>0x4</offset>
        <size>0x14</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>DIVIDEND</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>DIVIDEND</displayName>
          <description>Dividend Source Register (Signed 32-bit)</description>
          <addressOffset>0x4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Dividend</name>
              <description>Dividend Source\nThis register is given the dividend (signed 32-bit) of divider before calculation starts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>DIVISOR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>DIVISOR</displayName>
          <description>Divisor Source Resister (Signed 16-bit)</description>
          <addressOffset>0x8</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Divisor</name>
              <description>Divisor Source\nThis register is given the divisor of divider before calculation starts.\nNote: When this register is written, hardware divider will start calculation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>DIVQUO</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>DIVQUO</displayName>
          <description>Quotient Result Resister (Signed 32-bit)</description>
          <addressOffset>0xC</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Quotient</name>
              <description>Quotient Result\nThis register holds the quotient (signed 32-bit) result of divider after calculation completed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>DIVREM</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>DIVREM</displayName>
          <description>Reminder Result Register (Signed 16-bit)</description>
          <addressOffset>0x10</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Reminder</name>
              <description>Reminder Result\nThis register holds the reminder (signed 16-bit) result of divider after calculation completed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>DIVSTS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>DIVSTS</displayName>
          <description>Divider Status Register</description>
          <addressOffset>0x14</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIV_FINISH</name>
              <description>Divider Operation Finished\nThis register is read only.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The divider calculation not finished yet</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The divider calculation finished</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DIV0</name>
              <description>Divisor Zero Warning\nThis register is read only.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The divisor is not 0</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The divisor is 0</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DIVFF</name>
              <description>Divider Operation Finish Flag\nWhen divider calculation has finished, this bit is set to 1. This bit is cleared to 0 by writing 1 to it through software</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
