cmsis-svd/cmsis-svd/data/Nuvoton/M0519AE_v1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>EADC</name>
      <description>EADC Register Map</description>
      <groupName>EADC</groupName>
      <baseAddress>0x400E0000</baseAddress>
      <!-- the first addressBlock is occupied by registers. The second block is reserved -> no access permission -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x98</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xA4</offset>
        <size>0x18</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x100</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x120</offset>
        <size>0x44</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>ADDRA0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>ADDRA0</displayName>
          <description>A/D Data Register 0 for SAMPLEA0</description>
          <addressOffset>0x0</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSLT</name>
              <description>A/D Conversion Result\nThis field contains 12-bit conversion result.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OVERRUN</name>
              <description>over Run Flag\n</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Data in RSLT[11:0] is the recent conversion result</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Data in RSLT[11:0] is overwritten. If converted data in RSLT[11:0] has not been read before new conversion result is loaded to this register, OVERRUN is set to 1. It is cleared by hardware after ADDR register is read</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>VALID</name>
              <description>Valid Flag\nThis bit is set to 1 when corresponding SAMPLE channel analog input conversion is completed and cleared by hardware after ADDR register is read.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Data in RSLT[11:0] bits is not valid</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Data in RSLT[11:0] bits is valid</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="ADDRA0">
          <name>ADDRA1</name>
          <displayName>ADDRA1</displayName>
          <description>A/D Data Register 1 for SAMPLEA1</description>
          <addressOffset>0x4</addressOffset>
       </register>
       <register derivedFrom="ADDRA0">
          <name>ADDRA2</name>
          <displayName>ADDRA2</displayName>
          <description>A/D Data Register 2 for SAMPLEA2</description>
          <addressOffset>0x8</addressOffset>
       </register>
       <register derivedFrom="ADDRA0">
          <name>ADDRA3</name>
          <displayName>ADDRA3</displayName>
          <description>A/D Data Register 3 for SAMPLEA3</description>
          <addressOffset>0xC</addressOffset>
       </register>
       <register derivedFrom="ADDRA0">
          <name>ADDRA4</name>
          <displayName>ADDRA4</displayName>
          <description>A/D Data Register 4 for SAMPLEA4</description>
          <addressOffset>0x10</addressOffset>
       </register>
       <register derivedFrom="ADDRA0">
          <name>ADDRA5</name>
          <displayName>ADDRA5</displayName>
          <description>A/D Data Register 5 for SAMPLEA5</description>
          <addressOffset>0x14</addressOffset>
       </register>
       <register derivedFrom="ADDRA0">
          <name>ADDRA6</name>
          <displayName>ADDRA6</displayName>
          <description>A/D Data Register 6 for SAMPLEA6</description>
          <addressOffset>0x18</addressOffset>
       </register>
       <register derivedFrom="ADDRA0">
          <name>ADDRA7</name>
          <displayName>ADDRA7</displayName>
          <description>A/D Data Register 7 for SAMPLEA7</description>
          <addressOffset>0x1C</addressOffset>
       </register>
       <register derivedFrom="ADDRA0">
          <name>ADDRB0</name>
          <displayName>ADDRB0</displayName>
          <description>A/D Data Register 8 for SAMPLEB0</description>
          <addressOffset>0x20</addressOffset>
       </register>
       <register derivedFrom="ADDRA0">
          <name>ADDRB1</name>
          <displayName>ADDRB1</displayName>
          <description>A/D Data Register 9 for SAMPLEB1</description>
          <addressOffset>0x24</addressOffset>
       </register>
       <register derivedFrom="ADDRA0">
          <name>ADDRB2</name>
          <displayName>ADDRB2</displayName>
          <description>A/D Data Register 10 for SAMPLEB2</description>
          <addressOffset>0x28</addressOffset>
       </register>
       <register derivedFrom="ADDRA0">
          <name>ADDRB3</name>
          <displayName>ADDRB3</displayName>
          <description>A/D Data Register 11 for SAMPLEB3</description>
          <addressOffset>0x2C</addressOffset>
       </register>
       <register derivedFrom="ADDRA0">
          <name>ADDRB4</name>
          <displayName>ADDRB4</displayName>
          <description>A/D Data Register 12 for SAMPLEB4</description>
          <addressOffset>0x30</addressOffset>
       </register>
       <register derivedFrom="ADDRA0">
          <name>ADDRB5</name>
          <displayName>ADDRB5</displayName>
          <description>A/D Data Register 13 for SAMPLEB5</description>
          <addressOffset>0x34</addressOffset>
       </register>
       <register derivedFrom="ADDRA0">
          <name>ADDRB6</name>
          <displayName>ADDRB6</displayName>
          <description>A/D Data Register 14 for SAMPLEB6</description>
          <addressOffset>0x38</addressOffset>
       </register>
       <register derivedFrom="ADDRA0">
          <name>ADDRB7</name>
          <displayName>ADDRB7</displayName>
          <description>A/D Data Register 15 for SAMPLEB7</description>
          <addressOffset>0x3C</addressOffset>
       </register>
       <register>
          <name>ADCR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>ADCR</displayName>
          <description>A/D Control Register</description>
          <addressOffset>0x40</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AD_EN</name>
              <description>A/D Converter Enable Bit\nNote: Before starting the A/D conversion function, this bit should be set to 1. Clear it to 0 to disable A/D converter analog circuit power consumption.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>A/D converter Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>A/D converter Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ADRESET</name>
              <description>ADCA, ADCB A/D Converter Control Circuits Reset\nNote: This bit remains 1 during ADC reset, when ADC reset end, the ADRESET bit is automatically cleared to 0.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Writing 0 has no effect</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Writing 1 will cause ADC control circuits reset to initial state, but not change the ADC registers value</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ADIE0</name>
              <description>Specific SAMPLE A/D ADINT0 Interrupt Enable Bit\nThe A/D converter generates a conversion end ADF0 flag in ADSR1 register upon the end of specific SAMPLE A/D conversion. If ADIE0 bit is set then conversion end interrupt request ADINT0 is generated.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Specific SAMPLE A/D ADINT0 interrupt function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Specific SAMPLE A/D ADINT0 interrupt function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ADIE1</name>
              <description>Specific SAMPLE A/D ADINT1 Interrupt Enable Bit\nThe A/D converter generates a conversion end ADF1 flag in ADSR1 register upon the end of specific SAMPLE A/D conversion. If ADIE1 bit is set then conversion end interrupt request ADINT1 is generated.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Specific SAMPLE A/D ADINT1 interrupt function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Specific SAMPLE A/D ADINT1 interrupt function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ADIE2</name>
              <description>Specific SAMPLE A/D ADINT2 Interrupt Enable Bit\nThe A/D converter generates a conversion end ADF2 flag in ADSR1 register upon the end of specific SAMPLE A/D conversion. If ADIE2 bit is set then conversion end interrupt request ADINT2 is generated.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Specific SAMPLE A/D ADINT2 interrupt function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Specific SAMPLE A/D ADINT2 interrupt function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ADIE3</name>
              <description>Specific SAMPLE A/D ADINT3 Interrupt Enable Bit\nThe A/D converter generates a conversion end ADF3 flag in ADSR1 register upon the end of specific SAMPLE A/D conversion. If ADIE3 bit is set then conversion end interrupt request ADINT3 is generated.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Specific SAMPLE A/D ADINT3 interrupt function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Specific SAMPLE A/D ADINT3 interrupt function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>ADCHISELR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>ADCHISELR</displayName>
          <description>A/D Channel Input Sources Select Register</description>
          <addressOffset>0x44</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AINA0SEL</name>
              <description>A/D Channel AINA[0] Analog Input Selection \n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>AINA[0] pin P6.0/EADC0_CH0is selected as the ADC AINA[0] input signal</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>OP Amplifier 0 output  is selected as the ADC AINA[0] input signal</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>AINB0SEL</name>
              <description>A/D Channel AINB[0] Analog Input Selection\n</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>AINB[0] pin P7.0E/EADC1_CH0 is selected as the A/D AINB[0] input signal</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>OP Amplifier 1 output  is selected as the A/D AINB[0] input signal</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PRESEL</name>
              <description>A/D Channel AINA[7] Analog Input Selection\n</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Analog Input Channel AINA7</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Band-gap (VBG) Analog Input</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>VTEMP Internal Temperature Sensor Analog Input</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Analog ground</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>ADSSTR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>ADSSTR</displayName>
          <description>A/D SAMPLE Software Start Register</description>
          <addressOffset>0x48</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADST7_0</name>
              <description>A/D SAMPLEA7~0 Software Force to Start ADC Conversion Register \n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Cause an ADC conversion when the priority is given to SAMPLEA</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
            <field>
              <name>ADST15_8</name>
              <description>A/D SAMPLEB7~0 Software Force to Start ADC Conversion Register \n</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Cause an ADC conversion when the priority is given to SAMPLEB</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>ADSTPFR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>ADSTPFR</displayName>
          <description>A/D SAMPLE Start of Conversion Pending Flag Register</description>
          <addressOffset>0x4C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STPF7_0</name>
              <description>A/D SAMPLEA7~0 Start Conversion Pending Flag \n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>There is no pending conversion for SAMPLEA</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SAMPLEAn ADC start of conversion is pending</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>STPF15_8</name>
              <description>A/D SAMPLEB7~0 Start Conversion Pending Flag \n</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No pending conversion for SAMPLEB</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SAMPLEBn ADC start of conversion is pending</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
