cmsis-svd/cmsis-svd/data/Nuvoton/M0519AE_v1.svd
       <register>
          <name>ADIFOVR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>ADIFOVR</displayName>
          <description>A/D ADINT3~0 Interrupt Flag over Run Register</description>
          <addressOffset>0x50</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADFOV0</name>
              <description>A/D ADINT0  Interrupt Flag over Run Bit\nNote: This bit is cleared by writing 1 to 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>ADINT0 interrupt flag is not over run</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>ADINT0 interrupt flag is overwrite to 1</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ADFOV1</name>
              <description>A/D ADINT1  Interrupt Flag over Run Bit\nNote: This bit is cleared by writing 1 to 1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>ADINT1 interrupt flag is not over run</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>ADINT1 interrupt flag is overwrite to 1</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ADFOV2</name>
              <description>A/D ADINT2  Interrupt Flag over Run Bit\nNote: This bit is cleared by writing 1 to 1.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>ADINT2 interrupt flag is not over run</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>ADINT2 interrupt flag is overwrite to 1</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ADFOV3</name>
              <description>A/D ADINT3  Interrupt Flag over Run Bit\nNote: This bit is cleared by writing 1 to 1.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>ADINT3 interrupt flag is not over run</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>ADINT3 interrupt pulse received when ADF3 is 1</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>ADSPOVFR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>ADSPOVFR</displayName>
          <description>A/D SAMPLE Start of Conversion over Run Flag Register</description>
          <addressOffset>0x54</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SPOVF7_0</name>
              <description>A/D SAMPLEA7~SAMPLEA0 Start Conversion Overrun Flag\n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No SAMPLE event overrun</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Indicates new SAMPLEAn event is generated while an old one event is pending</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SPOVF15_8</name>
              <description>A/D SAMPLEB7~SAMPLEB0 Start Conversion Overrun Flag\n</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No SAMPLE event overrun</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Indicates new SAMPLEBn event is generated while an old one event is pending</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>ADSPCRA0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>ADSPCRA0</displayName>
          <description>A/D SAMPLEA0 Control Register</description>
          <addressOffset>0x58</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CHSEL</name>
              <description>A/D SAMPLEA,B Channel Selection\n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>AINx[0]</description>
                    <value>#000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>AINx[1]</description>
                    <value>#001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>AINx[2]</description>
                    <value>#010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>AINx[3]</description>
                    <value>#011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>AINx[4]</description>
                    <value>#100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>5</name>
                    <description>AINx[5]</description>
                    <value>#101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>AINx[6]</description>
                    <value>#110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>AINx[7]</description>
                    <value>#111</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>TRGSEL</name>
              <description>A/D SAMPLE Start Conversion Trigger Source Selection\n</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Disable hardware trigger</description>
                    <value>#0000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>External trigger from STADC pin input</description>
                    <value>#0001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>ADC ADINT0 interrupt EOC pulse  trigger</description>
                    <value>#0010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>ADC ADINT1 interrupt EOC pulse  trigger</description>
                    <value>#0011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>Timer0 overflow pulse trigger</description>
                    <value>#0100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>5</name>
                    <description>Timer1 overflow pulse trigger</description>
                    <value>#0101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>Timer2 overflow pulse trigger</description>
                    <value>#0110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>Timer3 overflow pulse trigger</description>
                    <value>#0111</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>8</name>
                    <description>PWM00 trigger</description>
                    <value>#1000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>9</name>
                    <description>PWM02 trigger</description>
                    <value>#1001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>10</name>
                    <description>PWM04 trigger</description>
                    <value>#1010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>11</name>
                    <description>PWM10 trigger</description>
                    <value>#1011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>12</name>
                    <description>PWM12 trigger</description>
                    <value>#1100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>13</name>
                    <description>PWM14 trigger</description>
                    <value>#1101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>14</name>
                    <description>PWM20 trigger</description>
                    <value>#1110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>15</name>
                    <description>PWM21 trigger</description>
                    <value>#1111</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>TRGDLYCNT</name>
              <description>A/D SAMPLE Start Conversion Trigger Delay Time\n</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRGDLYDIV</name>
              <description>A/D SAMPLE Start Conversion Trigger Delay Clock Divider Selection\nTrigger delay clock frequency:\n</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>ADC_CLK/1</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>ADC_CLK/2</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>ADC_CLK/4</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>ADC_CLK/16</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTREN</name>
              <description>A/D External Trigger Rising Edge Enable Bit\n</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Rising edge Disabled when A/D selects STADC as trigger source</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Rising edge Enabled when A/D selects STADC as trigger source</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTFEN</name>
              <description>A/D External Trigger Falling Edge Enable Bit\n</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Falling edge Disabled when A/D selects STADC as trigger source</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Falling edge Enabled when A/D selects STADC as trigger source</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="ADSPCRA0">
          <name>ADSPCRA1</name>
          <displayName>ADSPCRA1</displayName>
          <description>A/D SAMPLEA1 Control Register</description>
          <addressOffset>0x5C</addressOffset>
       </register>
       <register derivedFrom="ADSPCRA0">
          <name>ADSPCRA2</name>
          <displayName>ADSPCRA2</displayName>
          <description>A/D SAMPLEA2 Control Register</description>
          <addressOffset>0x60</addressOffset>
       </register>
       <register derivedFrom="ADSPCRA0">
          <name>ADSPCRA3</name>
          <displayName>ADSPCRA3</displayName>
          <description>A/D SAMPLEA3 Control Register</description>
          <addressOffset>0x64</addressOffset>
       </register>
       <register>
          <name>ADSPCRA4</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>ADSPCRA4</displayName>
          <description>A/D SAMPLEA4 Control Register</description>
          <addressOffset>0x68</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CHSEL</name>
              <description>A/D SAMPLEA,B Channel Selection\n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>AINx[0]</description>
                    <value>#000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>AINx[1]</description>
                    <value>#001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>AINx[2]</description>
                    <value>#010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>AINx[3]</description>
                    <value>#011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>AINx[4]</description>
                    <value>#100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>5</name>
                    <description>AINx[5]</description>
                    <value>#101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>AINx[6]</description>
                    <value>#110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>AINx[7]</description>
                    <value>#111</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>TRGSEL</name>
              <description>A/D SAMPLE Start Conversion Trigger Source Selection\n</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Disable hardware trigger</description>
                    <value>#000</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>External trigger from STADC pin input</description>
                    <value>#001</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>ADC ADINT0 interrupt EOC pulse trigger</description>
                    <value>#010</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>ADC ADINT1 interrupt EOC pulse trigger</description>
                    <value>#011</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>Timer0 overflow pulse trigger</description>
                    <value>#100</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>5</name>
                    <description>Timer1 overflow pulse trigger</description>
                    <value>#101</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>Timer2 overflow pulse trigger</description>
                    <value>#110</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>Timer3 overflow pulse trigger</description>
                    <value>#111</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTREN</name>
              <description>A/D External Trigger Rising Edge Enable Bit\n</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Rising edge Disabled when A/D selects STADC as trigger source</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Rising edge Enabled when A/D selects STADC as trigger source</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTFEN</name>
              <description>A/D External Trigger Falling Edge Enable Bit\n</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Falling edge Disabled when A/D selects STADC as trigger source</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Falling edge Enabled when A/D selects STADC as trigger source</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="ADSPCRA4">
          <name>ADSPCRA5</name>
          <displayName>ADSPCRA5</displayName>
          <description>A/D SAMPLEA5 Control Register</description>
          <addressOffset>0x6C</addressOffset>
       </register>
       <register derivedFrom="ADSPCRA4">
          <name>ADSPCRA6</name>
          <displayName>ADSPCRA6</displayName>
          <description>A/D SAMPLEA6 Control Register</description>
          <addressOffset>0x70</addressOffset>
       </register>
       <register derivedFrom="ADSPCRA4">
          <name>ADSPCRA7</name>
          <displayName>ADSPCRA7</displayName>
          <description>A/D SAMPLEA7 Control Register</description>
          <addressOffset>0x74</addressOffset>
       </register>
       <register derivedFrom="ADSPCRA0">
          <name>ADSPCRB0</name>
          <displayName>ADSPCRB0</displayName>
          <description>A/D SAMPLEB0 Control Register</description>
          <addressOffset>0x78</addressOffset>
       </register>
       <register derivedFrom="ADSPCRA0">
          <name>ADSPCRB1</name>
          <displayName>ADSPCRB1</displayName>
          <description>A/D SAMPLEB1 Control Register</description>
          <addressOffset>0x7C</addressOffset>
       </register>
